app/Services/UserService.php

select * from `users` limit 10
---
    public function get($limit)
    {
        return User::query()->limit($limit)->get();